injector2degHex/case_interPhaseChangeFoam/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//scale 0.001;

defaultFieldValues
(
    volScalarFieldValue alpha.water 0//vapour in the domain
    volScalarFieldValue p_rgh 35e5
);

injStart 30e-3;
injEnd 40e-3;

waterHeight #eval "$injStart + 0.25 * ($injEnd - $injStart)";

regions
(
    boxToCell
    {
        box (-100 $waterHeight -100) (100 100 100);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue p_rgh 45e5
        );
    }
);


// ************************************************************************* //
